# =============================================================================
# TAPS
# =============================================================================
tap "anomalyco/tap"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "localstack/tap"
tap "macos-fuse-t/cask"
tap "romkatv/powerlevel10k"
tap "warrensbox/tap"

# =============================================================================
# SYSTEM / BASE
# =============================================================================
brew "certifi"
brew "coreutils"
brew "cryptography"
brew "gdk-pixbuf"
brew "glib"
brew "gnu-sed"
brew "gobject-introspection"
brew "gtk+3"
brew "gtk4"
brew "harfbuzz"
brew "pango"
brew "pkgconf"
brew "py3cairo"
brew "pygobject3"
brew "tree"
brew "vte3"

# =============================================================================
# BUILD TOOLS
# =============================================================================
brew "maven"

# =============================================================================
# SHELL
# =============================================================================
brew "antidote"
brew "tmux"
brew "zsh"
brew "zsh-completions"
brew "zplug"
cask "ghostty"
cask "iterm2"

# =============================================================================
# VERSION CONTROL
# =============================================================================
brew "gh"
brew "git"
brew "git-filter-repo"

# =============================================================================
# EDITORS
# =============================================================================
brew "midnight-commander"
cask "intellij-idea"
cask "visual-studio-code"

# =============================================================================
# MODERN CLI TOOLS
# =============================================================================
brew "bat"
brew "bottom"
brew "btop"
brew "chezmoi"
brew "direnv"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gping"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "ncdu"
brew "procs"
brew "thefuck"
brew "tldr"
brew "yq"
brew "zoxide"

# =============================================================================
# NETWORKING
# =============================================================================
brew "aria2"
brew "curl"
brew "geoipupdate"
brew "iperf3"
brew "mosh"
brew "mtr"
brew "nmap"
brew "openconnect"
brew "speedtest-cli"
brew "sshpass"
brew "testssl"
brew "unbound"
brew "wget"
brew "wireguard-tools"
cask "cyberduck"
cask "tunnelblick"

# =============================================================================
# CONTAINERS & ORCHESTRATION
# =============================================================================
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "helm"
brew "kubernetes-cli"
brew "minikube"
brew "skaffold"

# =============================================================================
# CLOUD & INFRASTRUCTURE
# =============================================================================
brew "akamai"
brew "cloud-sql-proxy"
brew "hashicorp/tap/packer"
brew "localstack/tap/localstack-cli"
brew "ansible"
brew "ansible-lint"
brew "awscli"
brew "azure-cli"
cask "gcloud-cli"
cask "session-manager-plugin"
cask "vagrant"
cask "warrensbox/tap/tfswitch"

# =============================================================================
# LANGUAGES & RUNTIMES
# =============================================================================
brew "black"
brew "flake8"
brew "groovy"
brew "jenv"
brew "mise"
brew "mypy"
brew "node"
brew "numpy"
brew "nvm"
brew "openjdk"
brew "php"
brew "pipx"
brew "pre-commit"
brew "pygments"
brew "pytest"
brew "python@3.13"
brew "python@3.14"
brew "ruff"
brew "uv"
cask "miniconda"

# =============================================================================
# DEVELOPMENT TOOLS
# =============================================================================
brew "mysql-client"
brew "payload-dumper-go"
brew "specify"
cask "dbeaver-community"
cask "fork"
cask "postman"

# =============================================================================
# MEDIA & FILE TOOLS
# =============================================================================
brew "dos2unix"
brew "ffmpeg"
brew "graphviz"
brew "grep"
brew "imagemagick"
brew "wimlib"
brew "xz"
brew "yt-dlp"
cask "handbrake-app"
cask "iina"
cask "jellyfin-media-player"
cask "obs"
cask "vlc"

# =============================================================================
# SYSTEM MONITORING & UTILITIES
# =============================================================================
brew "aircrack-ng"
brew "goaccess"
brew "putty"
brew "telnet"
brew "terminator"
brew "watch"
cask "appcleaner"
cask "grandperspective"
cask "maccy"
cask "stats"
cask "utm"

# =============================================================================
# FONTS
# =============================================================================
cask "font-hack-nerd-font"

# =============================================================================
# AI / LLM TOOLS
# =============================================================================
brew "anomalyco/tap/opencode" # tracks v1.15.11
brew "gemini-cli"
cask "boltai"

# =============================================================================
# GUI APPLICATIONS
# =============================================================================
cask "amazon-chime"
cask "android-platform-tools"
cask "antigravity"
cask "anydesk"
cask "applepi-baker"
cask "balenaetcher"
cask "bitwarden"
cask "discord"
cask "displaylink"
cask "drawio"
cask "firefox"
cask "flux-app"
cask "fuse-t"
cask "google-chrome"
cask "gotomeeting"
cask "jdownloader"
cask "keepassxc"
cask "macos-fuse-t/cask/fuse-t-sshfs"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "openmtp"
cask "projectlibre"
cask "rar"
cask "sdformatter"
cask "slack"
cask "spotify"
cask "steam"
cask "telegram-desktop"
cask "whatsapp"
cask "zoom"

# =============================================================================
# VSCODE EXTENSIONS
# =============================================================================
vscode "alexkrechik.cucumberautocomplete"
vscode "atlassian.atlascode"
vscode "bierner.markdown-mermaid"
vscode "darian-benam.vscode-apache-dispatcher-config-language-support"
vscode "docker.docker"
vscode "github.copilot-chat"
vscode "hashicorp.terraform"
vscode "jamief.vscode-ssh-config-enhanced"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "tomoki1207.pdf"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "yzhang.markdown-all-in-one"

# =============================================================================
# PYTHON UV PACKAGES
# =============================================================================
uv "dormakaba-py"

# =============================================================================
# NEWLY INSTALLED (UNCATEGORIZED)
# =============================================================================
tap "gromgit/fuse", trusted: true
tap "macos-fuse-t/cask", trusted: true
tap "nozomi-koborinai/tap"
tap "romkatv/powerlevel10k", trusted: true
tap "zircoz/gam", "https://github.com/Zircoz/homebrew-gam"
# Next-generation aircrack with lots of new features
# CLI toolkit for working with Akamai's APIs
# Mozilla CA bundle for Python
# Cryptographic recipes and primitives for Python
# General-purpose data compression with high compression ratio
# Interpreted, interactive, object-oriented programming language
# Display directories as trees (with optional color/HTML output)
# Automate deployment, configuration, and upgrading
# Checks ansible playbooks for practices and behaviour
# Plugin manager for zsh, inspired by antigen and antibody
# Download with resuming and segmented downloading
# Core application library for C
# Official Amazon AWS command-line interface
# Interpreted, interactive, object-oriented programming language
# Microsoft Azure CLI 2.0
# Clone of cat(1) with syntax highlighting and Git integration
# Python code formatter
# Yet another cross-platform graphical process/system monitor
# Resource monitor. C++ version and continuation of bashtop and bpytop
# Manage your dotfiles across multiple diverse machines, securely
# Utility for connecting securely to your Cloud SQL instances
# Container runtimes on MacOS (and Linux) with minimal setup
# GNU File, Shell, and Text utilities
# Get a file from an HTTP, HTTPS or FTP server
# Load/unload environment variables based on $PWD
# Pack, ship and run any application as a lightweight container
# Isolated development environments using Docker
# Platform keystore credential helper for Docker
# Convert text between DOS, UNIX, and Mac formats
# Disk Usage/Free Utility - a better 'df' alternative
# More intuitive version of du in rust
# Modern, maintained replacement for ls
# Simple, fast and user-friendly alternative to find
# Play, record, convert, and stream select audio and video codecs
# Lint your Python code for style and logical errors
# Command-line fuzzy finder written in Go
# Toolkit for image loading and pixel buffer manipulation
# Open-source, cross-platform JavaScript runtime environment
# Interact with Google Gemini AI models from the command-line
# Automatic updates of GeoIP2 and GeoIP Legacy databases
# GitHub command-line tool
# Distributed revision control system
# Quickly rewrite git repository history
# GNU implementation of the famous stream editor
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Log analyzer and interactive viewer for the Apache Webserver
# Package compiler and linker metadata toolkit
# Generate introspection data for GObject libraries
# Ping, but with a graph
# OpenType text shaping engine
# Framework for layout and rendering of i18n text
# Graph visualization software from AT&T and Bell Labs
# GNU grep, egrep and fgrep
# Development kit for the Java programming language
# Java-based scripting language
# Toolkit for creating graphical user interfaces
# Toolkit for creating graphical user interfaces
# Kubernetes package manager
# Improved top (interactive process viewer)
# User-friendly cURL replacement (command-line HTTP client)
# Command-line benchmarking tool
# Tools and libraries to manipulate images in select formats
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
# Manage your Java environment
# Lightweight and flexible command-line JSON processor
# Kubernetes command-line interface
# Lazier way to manage everything docker
# Simple terminal UI for git commands
# Java-based project management
# Terminal-based visual file manager
# Run a Kubernetes cluster locally
# Polyglot runtime manager (asdf rust clone)
# Remote terminal application
# 'traceroute' and 'ping' in a single tool
# Experimental optional static type checker for Python
# Open source relational database management system
# NCurses Disk Usage
# Port scanning utility for large networks
# Package for scientific computing with Python
# Manage multiple Node.js versions
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# Open client for Cisco AnyConnect VPN
# Android OTA payload dumper written in Go
# General-purpose scripting language
# Execute binaries from Python packages in isolated environments
# Framework for managing multi-language pre-commit hooks
# Modern replacement for ps written in Rust
# Implementation of Telnet and SSH
# Python 3 bindings for the Cairo graphics library
# Generic syntax highlighter
# GNOME Python bindings (based on GObject Introspection)
# Simple powerful testing with Python
# Extremely fast Python linter, written in Rust
# Easy and Repeatable Kubernetes Development
# Toolkit to help you get started with Spec-Driven Development
# Command-line interface for https://speedtest.net bandwidth tests
# Non-interactive SSH password auth
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# User interface to the TELNET protocol
# Validating, recursive, caching DNS resolver
# Terminal emulator widget used by GNOME terminal
# Multiple GNOME terminals in one window
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Tool which checks for the support of TLS/SSL ciphers and flaws
# Programmatically correct mistyped console commands
# Simplified and community-driven man pages
# Terminal multiplexer
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
# Executes a program periodically, showing output fullscreen
# Internet file retriever
# Library to create, extract, and modify Windows Imaging files
# Tools for the WireGuard secure network tunnel
# Process YAML, JSON, XML, CSV and properties documents from the CLI
# Feature-rich command-line audio/video downloader
# Shell extension to navigate your filesystem faster
# Next-generation plugin manager for zsh
# UNIX shell (command interpreter)
# Additional completion definitions for zsh
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Packer
brew "hashicorp/tap/packer", trusted: true
# Localstack cli packaged using pyinstaller
brew "localstack/tap/localstack-cli", trusted: true
# MCP server for estimating Google Cloud running costs
brew "nozomi-koborinai/tap/gcp-cost-mcp-server", trusted: true
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch", link: false, trusted: true
# Command line management for Google Workspace
brew "zircoz/gam/gam7", trusted: true
# Communications service
# Android SDK component
# Agent orchestration platform
# Allows connection to a computer remotely
# Application uninstaller
# Backup and restore SD cards, USB drives, external HDD, etc
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
# Desktop password and login vault
# AI chat client
# Terminal-based AI coding assistant
cask "claude-code"
# Server and cloud storage browser
# Universal database tool and SQL client
# Voice and text chat software
# Drivers for DisplayLink docks, adapters and monitors
# Online diagram software
# Desktop AI agent
cask "eigent"
# Web browser
# Screen colour temperature controller
cask "font-fontawesome"
cask "font-ibm-plex-sans"
# GIT client
# Kext-less implementation of FUSE
# SSHFS implementation based on FUSE-T
# Set of tools to manage resources and applications hosted on Google Cloud
# Terminal emulator that uses platform-native UI and GPU acceleration
# Web browser
# Online meetings, desktop sharing, and video conferencing
# Graphically shows disk usage within a file system
# Open-source video transcoder
# Free and open-source media player
# Vector graphics editor
cask "inkscape"
# Java IDE by JetBrains
# Terminal emulator as alternative to Apple's Terminal app
# Download manager
# Jellyfin desktop client
# Password manager app
# Clipboard manager
# Provides updates to various Microsoft products
# Meet, chat, call, and collaborate in just one place
# Minimal installer for conda
# Open-source software for live streaming and screen recording
# Android file transfer
# Collaboration platform for API development
# Microsoft Project in your browser
# Archive manager for data compression and backups
# Tool to format memory cards complying with the SD File System spec
# Plugin for AWS CLI to start and end sessions that connect to managed instances
# Team communication and collaboration software
# Music streaming service
# System monitor for the menu bar
# Video game digital distribution service
# Desktop client for Telegram messenger
# The tfswitch command lets you switch between terraform versions.
# Free and open-source OpenVPN client
# Virtual machines UI using QEMU
# Development environment
# Open-source code editor
# Multimedia player
# Native desktop client for WhatsApp
# Video communication and virtual meeting platform
npm "@dietrichgebert/ponytail"
npm "@fission-ai/openspec"
npm "@smithery/cli"
npm "litellm"
npm "officecli"
npm "resume-schema"
