# .zsh_plugins.txt - antidote plugins file
# One plugin per line. Comments begin with "#".

# OMZ dependencies (must come before OMZ plugins)
getantidote/use-omz

# Oh-My-Zsh plugins
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/z
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/colorize
ohmyzsh/ohmyzsh path:plugins/common-aliases
ohmyzsh/ohmyzsh path:plugins/iterm2
ohmyzsh/ohmyzsh path:plugins/macos
ohmyzsh/ohmyzsh path:plugins/zsh-navigation-tools

# Extra zsh completions
zsh-users/zsh-completions kind:fpath path:src

# Conda completions
esc/conda-zsh-completion kind:fpath

# NVM lazy-loading (loads nvm only when you first call node/npm/nvm)
lukechilds/zsh-nvm kind:defer

# Powerlevel10k theme
romkatv/powerlevel10k

# Fish-like auto suggestions (deferred for speed)
zsh-users/zsh-autosuggestions kind:defer

# Syntax highlighting (deferred, must be last)
zsh-users/zsh-syntax-highlighting kind:defer
